TexasInstruments/f29h85x-sdk/source/driverlib/fsi.h
typedef enum
{
	FSI_EXT_TRIGSRC_EPWM_XBARTRIP4		 = 0,	//!EXT TRIGSRC EPWM XBARTRIP4
	FSI_EXT_TRIGSRC_EPWM_XBARTRIP5		 = 1,	//!EXT TRIGSRC EPWM XBARTRIP5
	FSI_EXT_TRIGSRC_EPWM_XBARTRIP7		 = 2,	//!EXT TRIGSRC EPWM XBARTRIP7
	FSI_EXT_TRIGSRC_EPWM_XBARTRIP8		 = 3,	//!EXT TRIGSRC EPWM XBARTRIP8
	FSI_EXT_TRIGSRC_EPWM_XBARTRIP9		 = 4,	//!EXT TRIGSRC EPWM XBARTRIP9
	FSI_EXT_TRIGSRC_EPWM_XBARTRIP10		 = 5,	//!EXT TRIGSRC EPWM XBARTRIP10
	FSI_EXT_TRIGSRC_EPWM_XBARTRIP11		 = 6,	//!EXT TRIGSRC EPWM XBARTRIP11
	FSI_EXT_TRIGSRC_EPWM_XBARTRIP12		 = 7,	//!EXT TRIGSRC EPWM XBARTRIP12
	FSI_EXT_TRIGSRC_EPWM1_SOCA		 = 8,	//!EXT TRIGSRC EPWM1 SOCA
	FSI_EXT_TRIGSRC_EPWM1_SOCB		 = 9,	//!EXT TRIGSRC EPWM1 SOCB
	FSI_EXT_TRIGSRC_EPWM2_SOCA		 = 10,	//!EXT TRIGSRC EPWM2 SOCA
	FSI_EXT_TRIGSRC_EPWM2_SOCB		 = 11,	//!EXT TRIGSRC EPWM2 SOCB
	FSI_EXT_TRIGSRC_EPWM3_SOCA		 = 12,	//!EXT TRIGSRC EPWM3 SOCA
	FSI_EXT_TRIGSRC_EPWM3_SOCB		 = 13,	//!EXT TRIGSRC EPWM3 SOCB
	FSI_EXT_TRIGSRC_EPWM4_SOCA		 = 14,	//!EXT TRIGSRC EPWM4 SOCA
	FSI_EXT_TRIGSRC_EPWM4_SOCB		 = 15,	//!EXT TRIGSRC EPWM4 SOCB
	FSI_EXT_TRIGSRC_EPWM5_SOCA		 = 16,	//!EXT TRIGSRC EPWM5 SOCA
	FSI_EXT_TRIGSRC_EPWM5_SOCB		 = 17,	//!EXT TRIGSRC EPWM5 SOCB
	FSI_EXT_TRIGSRC_EPWM6_SOCA		 = 18,	//!EXT TRIGSRC EPWM6 SOCA
	FSI_EXT_TRIGSRC_EPWM6_SOCB		 = 19,	//!EXT TRIGSRC EPWM6 SOCB
	FSI_EXT_TRIGSRC_EPWM7_SOCA		 = 20,	//!EXT TRIGSRC EPWM7 SOCA
	FSI_EXT_TRIGSRC_EPWM7_SOCB		 = 21,	//!EXT TRIGSRC EPWM7 SOCB
	FSI_EXT_TRIGSRC_EPWM8_SOCA		 = 22,	//!EXT TRIGSRC EPWM8 SOCA
	FSI_EXT_TRIGSRC_EPWM8_SOCB		 = 23,	//!EXT TRIGSRC EPWM8 SOCB
	FSI_EXT_TRIGSRC_EPWM9_SOCA		 = 24,	//!EXT TRIGSRC EPWM9 SOCA
	FSI_EXT_TRIGSRC_EPWM9_SOCB		 = 25,	//!EXT TRIGSRC EPWM9 SOCB
	FSI_EXT_TRIGSRC_EPWM10_SOCA		 = 26,	//!EXT TRIGSRC EPWM10 SOCA
	FSI_EXT_TRIGSRC_EPWM10_SOCB		 = 27,	//!EXT TRIGSRC EPWM10 SOCB
	FSI_EXT_TRIGSRC_EPWM11_SOCA		 = 28,	//!EXT TRIGSRC EPWM11 SOCA
	FSI_EXT_TRIGSRC_EPWM11_SOCB		 = 29,	//!EXT TRIGSRC EPWM11 SOCB
	FSI_EXT_TRIGSRC_EPWM12_SOCA		 = 30,	//!EXT TRIGSRC EPWM12 SOCA
	FSI_EXT_TRIGSRC_EPWM12_SOCB		 = 31,	//!EXT TRIGSRC EPWM12 SOCB
	FSI_EXT_TRIGSRC_EPWM13_SOCA		 = 32,	//!EXT TRIGSRC EPWM13 SOCA
	FSI_EXT_TRIGSRC_EPWM13_SOCB		 = 33,	//!EXT TRIGSRC EPWM13 SOCB
	FSI_EXT_TRIGSRC_EPWM14_SOCA		 = 34,	//!EXT TRIGSRC EPWM14 SOCA
	FSI_EXT_TRIGSRC_EPWM14_SOCB		 = 35,	//!EXT TRIGSRC EPWM14 SOCB
	FSI_EXT_TRIGSRC_EPWM15_SOCA		 = 36,	//!EXT TRIGSRC EPWM15 SOCA
	FSI_EXT_TRIGSRC_EPWM15_SOCB		 = 37,	//!EXT TRIGSRC EPWM15 SOCB
	FSI_EXT_TRIGSRC_EPWM16_SOCA		 = 38,	//!EXT TRIGSRC EPWM16 SOCA
	FSI_EXT_TRIGSRC_EPWM16_SOCB		 = 39,	//!EXT TRIGSRC EPWM16 SOCB
	FSI_EXT_TRIGSRC_CLB1_CLBOUT30		 = 40,	//!EXT TRIGSRC CLB1 CLBOUT30
	FSI_EXT_TRIGSRC_CLB1_CLBOUT31		 = 41,	//!EXT TRIGSRC CLB1 CLBOUT31
	FSI_EXT_TRIGSRC_CLB2_CLBOUT30		 = 42,	//!EXT TRIGSRC CLB2 CLBOUT30
	FSI_EXT_TRIGSRC_CLB2_CLBOUT31		 = 43,	//!EXT TRIGSRC CLB2 CLBOUT31
	FSI_EXT_TRIGSRC_CLB3_CLBOUT30		 = 44,	//!EXT TRIGSRC CLB3 CLBOUT30
	FSI_EXT_TRIGSRC_CLB3_CLBOUT31		 = 45,	//!EXT TRIGSRC CLB3 CLBOUT31
	FSI_EXT_TRIGSRC_CLB4_CLBOUT30		 = 46,	//!EXT TRIGSRC CLB4 CLBOUT30
	FSI_EXT_TRIGSRC_CLB4_CLBOUT31		 = 47,	//!EXT TRIGSRC CLB4 CLBOUT31
	FSI_EXT_TRIGSRC_CLB5_CLBOUT30		 = 48,	//!EXT TRIGSRC CLB5 CLBOUT30
	FSI_EXT_TRIGSRC_CLB5_CLBOUT31		 = 49,	//!EXT TRIGSRC CLB5 CLBOUT31
	FSI_EXT_TRIGSRC_CLB6_CLBOUT30		 = 50,	//!EXT TRIGSRC CLB6 CLBOUT30
	FSI_EXT_TRIGSRC_CLB6_CLBOUT31		 = 51,	//!EXT TRIGSRC CLB6 CLBOUT31
	FSI_EXT_TRIGSRC_ADC_SOCA		 = 52,	//!EXT TRIGSRC ADC SOCA
	FSI_EXT_TRIGSRC_ADC_SOCB		 = 53,	//!EXT TRIGSRC ADC SOCB
	FSI_EXT_TRIGSRC_CPU1_TIMER0INT		 = 54,	//!EXT TRIGSRC CPU1 TIMER0INT
	FSI_EXT_TRIGSRC_CPU1_TIMER1INT		 = 55,	//!EXT TRIGSRC CPU1 TIMER1INT
	FSI_EXT_TRIGSRC_CPU1_TIMER2INT		 = 56,	//!EXT TRIGSRC CPU1 TIMER2INT
	FSI_EXT_TRIGSRC_CPU2_TIMER0INT		 = 57,	//!EXT TRIGSRC CPU2 TIMER0INT
	FSI_EXT_TRIGSRC_CPU2_TIMER1INT		 = 58,	//!EXT TRIGSRC CPU2 TIMER1INT
	FSI_EXT_TRIGSRC_CPU2_TIMER2INT		 = 59,	//!EXT TRIGSRC CPU2 TIMER2INT
	FSI_EXT_TRIGSRC_CPU3_TIMER0INT		 = 60,	//!EXT TRIGSRC CPU3 TIMER0INT
	FSI_EXT_TRIGSRC_CPU3_TIMER1INT		 = 61,	//!EXT TRIGSRC CPU3 TIMER1INT
	FSI_EXT_TRIGSRC_CPU3_TIMER2INT		 = 62,	//!EXT TRIGSRC CPU3 TIMER2INT
	FSI_EXT_TRIGSRC_RTDMA1_CH1		 = 63,	//!EXT TRIGSRC RTDMA1 CH1
	FSI_EXT_TRIGSRC_RTDMA1_CH2		 = 64,	//!EXT TRIGSRC RTDMA1 CH2
	FSI_EXT_TRIGSRC_RTDMA1_CH3		 = 65,	//!EXT TRIGSRC RTDMA1 CH3
	FSI_EXT_TRIGSRC_RTDMA1_CH4		 = 66,	//!EXT TRIGSRC RTDMA1 CH4
	FSI_EXT_TRIGSRC_RTDMA1_CH5		 = 67,	//!EXT TRIGSRC RTDMA1 CH5
	FSI_EXT_TRIGSRC_RTDMA1_CH6		 = 68,	//!EXT TRIGSRC RTDMA1 CH6
	FSI_EXT_TRIGSRC_RTDMA1_CH7		 = 69,	//!EXT TRIGSRC RTDMA1 CH7
	FSI_EXT_TRIGSRC_RTDMA1_CH8		 = 70,	//!EXT TRIGSRC RTDMA1 CH8
	FSI_EXT_TRIGSRC_RTDMA1_CH9		 = 71,	//!EXT TRIGSRC RTDMA1 CH9
	FSI_EXT_TRIGSRC_RTDMA1_CH10		 = 72,	//!EXT TRIGSRC RTDMA1 CH10
	FSI_EXT_TRIGSRC_RTDMA2_CH1		 = 73,	//!EXT TRIGSRC RTDMA2 CH1
	FSI_EXT_TRIGSRC_RTDMA2_CH2		 = 74,	//!EXT TRIGSRC RTDMA2 CH2
	FSI_EXT_TRIGSRC_RTDMA2_CH3		 = 75,	//!EXT TRIGSRC RTDMA2 CH3
	FSI_EXT_TRIGSRC_RTDMA2_CH4		 = 76,	//!EXT TRIGSRC RTDMA2 CH4
	FSI_EXT_TRIGSRC_RTDMA2_CH5		 = 77,	//!EXT TRIGSRC RTDMA2 CH5
	FSI_EXT_TRIGSRC_RTDMA2_CH6		 = 78,	//!EXT TRIGSRC RTDMA2 CH6
	FSI_EXT_TRIGSRC_RTDMA2_CH7		 = 79,	//!EXT TRIGSRC RTDMA2 CH7
	FSI_EXT_TRIGSRC_RTDMA2_CH8		 = 80,	//!EXT TRIGSRC RTDMA2 CH8
	FSI_EXT_TRIGSRC_RTDMA2_CH9		 = 81,	//!EXT TRIGSRC RTDMA2 CH9
	FSI_EXT_TRIGSRC_RTDMA2_CH10		 = 82,	//!EXT TRIGSRC RTDMA2 CH10
	FSI_EXT_TRIGSRC_FSIACBDRX_TRIG0		 = 87,	//!EXT TRIGSRC FSIACBDRX TRIG0
	FSI_EXT_TRIGSRC_FSIABCDRX_TRIG1		 = 88,	//!EXT TRIGSRC FSIABCDRX TRIG1
	FSI_EXT_TRIGSRC_FSIABCDRX_TRIG2		 = 89,	//!EXT TRIGSRC FSIABCDRX TRIG2
	FSI_EXT_TRIGSRC_FSIABCDRX_TRIG3		 = 90,	//!EXT TRIGSRC FSIABCDRX TRIG3
	FSI_EXT_TRIGSRC_EPWM17_SOCA		 = 95,	//!EXT TRIGSRC EPWM17 SOCA
	FSI_EXT_TRIGSRC_EPWM17_SOCB		 = 96,	//!EXT TRIGSRC EPWM17 SOCB
	FSI_EXT_TRIGSRC_EPWM18_SOCA		 = 97,	//!EXT TRIGSRC EPWM18 SOCA
	FSI_EXT_TRIGSRC_EPWM18_SOCB		 = 98	//!EXT TRIGSRC EPWM18 SOCB
} FSI_ExtFrameTriggerSrc;

//*****************************************************************************
//
// FSI Tx function prototypes/defintion
//
//*****************************************************************************

//*****************************************************************************
//
//! \brief Validates if FSI-Tx base address is correct
//!
//! \param[in] base is the base address of the FSI-Tx module
//!
//! \return returns \b true if the base address is valid and \b false otherwise
//
//*****************************************************************************
#ifdef DEBUG
__attribute__((always_inline))
static inline bool
FSI_isTxBaseValid(uint32_t base)
{
    return(
           ((base & BASE_ADDR_MASK) == FSITXA_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == FSITXB_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == FSITXC_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == FSITXD_BASE_FRAME(0U))
          );
}
#endif

//*****************************************************************************
//
//! \brief Sends FLUSH pattern
//!
//! \details FLUSH pattern (toggle data lines followed by toggle on clocks)
//!          should be sent only when FSI Tx is not under \b SOFT_RESET and the
//!          clock to the transmit core has been turned ON.
//!
//! \param[in] base is the FSI Tx module base address
//!
//! \return None.
//
//*****************************************************************************
__attribute__((always_inline))
static inline void
FSI_sendTxFlush(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(FSI_isTxBaseValid(base));

